Revit 2026 API

# DirectShapeFailures Properties

---

The BuiltInFailuresDirectShapeFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateDirectShapeOrTypeDocumentCorruption | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeOrTypeError | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeOrTypeWarning | Cannot create a DirectShape or DirectShapeType. |
|  | CannotCreateDirectShapeRefsWarning | Cannot create reference objects for a DirectShape. |
|  | CannotCreateDirectShapeTypeRefsWarning | Cannot create reference objects for a DirectShapeType. |

#### Reference

BuiltInFailuresDirectShapeFailures Class

Autodesk.Revit.DB Namespace